### data selection, filtering

#### DataFrame의 [] 연산자

* Numpy 에서 [] 연산자는 행과 열의 위치, 슬라이싱 범위 등을 지정해서 data를 가져옴. DataFrame바로 오른쪽에 있는 [] 안에 넣을 수 있는 것은 컬럼명 문자(또는 컬럼명의 리스트 객체), 또는 index로 변환이 가능한 표현식임

In [6]:
import pandas as pd
import numpy as np

train_df = pd.read_csv('train.csv')
print('단일 컬럼 data 추출 :\n',train_df['Pclass'].head(3))
print('\n여러 컬럼들의 data 추출 :\n',train_df[['Survived', 'Pclass']].head(3))
# print('[] 안의 숫자 index는 KeyError: 0 발생시킴 :\n', train_df[0])

단일 컬럼 data 추출 :
 0    3
1    1
2    3
Name: Pclass, dtype: int64

여러 컬럼들의 data 추출 :
    Survived  Pclass
0         0       3
1         1       1
2         1       3

In [8]:
# [0:2] <-- 0행과 1행을 조회함
train_df[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [9]:
# Pclass 컬럼 값이 3인 row만 조회함
train_df[train_df['Pclass']==3].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S